#include<iostream>
#include<cstring>
using namespace std;
int main(){
    int len;
    cin >> len;
    string s;
    cin >> s;
    char ans[5][410];
//把所有元素初始化为'.'
    char num[10][5][3] = {
        {
            {'X', 'X', 'X'},
            {'X', '.', 'X'},
            {'X', '.', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'}
        },
        {
            {'.', '.', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'X', 'X', 'X'},
            {'X', '.', '.'},
            {'X', 'X', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'X', 'X', 'X'}
        },
        {
            {'X', '.', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'X', '.', '.'},
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'X', 'X', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'X', '.', '.'},
            {'X', 'X', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'},
            {'.', '.', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'}
        },
        {
            {'X', 'X', 'X'},
            {'X', '.', 'X'},
            {'X', 'X', 'X'},
            {'.', '.', 'X'},
            {'X', 'X', 'X'}
        }
    }; //用三维数组存所有数字的字符图案（注意赋值需要写；）

    //输出逻辑是先用上面的数字模板把下面要输出的内容全部计算好再一起输出
    for(int i = 0; i < len; i++){ //每次循环代表计算一位
        for(int j = 0; j < 5; j++){ //每次循环代表计算一行
            for(int k = 0; k < 3; k++){ //i*4+k是因为每个数字占3列，数字之间有1列空格，所以每个数字占4列
                ans[j][i * 4 + k] = num[s[i] - '0'][j][k];
            }
        }
    }
    for(int i = 0; i < 5; i++){
        for(int j = 0; j < len * 4 - 1; j++){ //注意这里是len*4-1，因为最后一位数字后面没有空格
            cout << ans[i][j];
        }
        cout << endl;
    }
    return 0;
}